; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?o1 ?o2)
	       (ontable ?o1)
	       (clear ?o1)
	       (handempty)
	       (holding ?o1)
	       )

  (:action pick-up
	     :parameters (?o1)
	     :precondition (and (clear ?o1) (ontable ?o1) (handempty))
	     :effect
	     (and (not (ontable ?o1))
		   (not (clear ?o1))
		   (not (handempty))
		   (holding ?o1)))

  (:action put-down
	     :parameters (?o1)
	     :precondition (and (holding ?o1))
	     :effect
	     (and (not (holding ?o1))
		   (clear ?o1)
		   (handempty)
		   (ontable ?o1)))
  (:action stack
	     :parameters (?o1 ?o2)
	     :precondition (and (holding ?o1) (clear ?o2))
	     :effect
	     (and (not (holding ?o1))
		   (not (clear ?o2))
		   (clear ?o1)
		   (handempty)
		   (on ?o1 ?o2)))
  (:action unstack
	     :parameters (?o1 ?o2)
	     :precondition (and (on ?o1 ?o2) (clear ?o1) (handempty))
	     :effect
	     (and (holding ?o1)
		   (clear ?o2)
		   (not (clear ?o1))
		   (not (handempty))
		   (not (on ?o1 ?o2)))))

; problem
(define (problem blocks-7-1)
  (:domain blocks)
  (:objects b -  object d -  object f -  object e -  object c -  object g -  object a -  object )
  (:init (ontable g) (ontable f) (clear a) (on a g) (ontable d) (clear b) (ontable b) (clear f) (clear e) (ontable e) (clear c) (handempty ) (on c d) )
  (:goal (and (ontable d)(clear b)(ontable b)(clear e)(ontable e)(on c d)(clear a)(ontable a)(clear g)(on g c)(holding f)(not (on e e))(not (on e b))(not (on e d))(not (on e f))(not (on e g))(not (on e c))(not (on e a))(not (on b e))(not (on b b))(not (on b d))(not (on b f))(not (on b g))(not (on b c))(not (on b a))(not (on d e))(not (on d b))(not (on d d))(not (on d f))(not (on d g))(not (on d c))(not (on d a))(not (on f e))(not (on f b))(not (on f d))(not (on f f))(not (on f g))(not (on f c))(not (on f a))(not (on g e))(not (on g b))(not (on g d))(not (on g f))(not (on g g))(not (on g a))(not (on c e))(not (on c b))(not (on c f))(not (on c g))(not (on c c))(not (on c a))(not (on a e))(not (on a b))(not (on a d))(not (on a f))(not (on a g))(not (on a c))(not (on a a))(not (ontable f))(not (ontable g))(not (ontable c))(not (clear d))(not (clear f))(not (clear c))(not (handempty ))(not (holding e))(not (holding b))(not (holding d))(not (holding g))(not (holding c))(not (holding a)))))

; plan
1. (unstack a g)
   deleted: (clear a) (handempty) (on a g)
   added: (holding a) (clear g)
   goals met: 62 of 71
2. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 64 of 71
3. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 64 of 71
4. (stack g c)
   deleted: (holding g) (clear c)
   added: (clear g) (handempty) (on g c)
   goals met: 67 of 71
5. (pick-up f)
   deleted: (ontable f) (clear f) (handempty)
   added: (holding f)
   goals met: 71 of 71
